#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/df9b00f9-8998-43f5-87b2-605cac767464/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_s3_object.redirects["/commands/community/dropall.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/community/dropall.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/update/drop-all.html" -> "/commands/maintenance/drop-all.html"
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/dropall.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/dropall.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/update/drop-all.html" -> "/commands/maintenance/drop-all.html"
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/maintenance/drop-all.html"] will be destroyed
  # (because key ["/commands/maintenance/drop-all.html"] is not in for_each map)
  - resource "aws_s3_object" "redirects" {
      - bucket                 = "stage-docsstageliquibasecom-origin" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/html" -> null
      - etag                   = "5efd5c28378eb29599a8245a4097292b" -> null
      - force_destroy          = false -> null
      - id                     = "/commands/maintenance/drop-all.html" -> null
      - key                    = "/commands/maintenance/drop-all.html" -> null
      - metadata               = {
          - "user-agent"    = "AWSTransfer"
          - "user-agent-id" = "awilliams@s-53428b82285849a98"
        } -> null
      - server_side_encryption = "AES256" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "null" -> null
    }

  # aws_s3_object.redirects["/commands/update/drop-all.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/update/drop-all.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/maintenance/drop-all.html"
    }

Plan: 1 to add, 2 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_s3_object.redirects["/commands/community/dropall.html"] will be updated in-place%0A  ~ resource "aws_s3_object" "redirects" {%0A        id                     = "/commands/community/dropall.html"%0A        tags                   = {}%0A      ~ version_id             = "null" -> (known after apply)%0A      ~ website_redirect       = "/commands/update/drop-all.html" -> "/commands/maintenance/drop-all.html"%0A        # (10 unchanged attributes hidden)%0A    }%0A%0A  # aws_s3_object.redirects["/commands/dropall.html"] will be updated in-place%0A  ~ resource "aws_s3_object" "redirects" {%0A        id                     = "/commands/dropall.html"%0A        tags                   = {}%0A      ~ version_id             = "null" -> (known after apply)%0A      ~ website_redirect       = "/commands/update/drop-all.html" -> "/commands/maintenance/drop-all.html"%0A        # (10 unchanged attributes hidden)%0A    }%0A%0A  # aws_s3_object.redirects["/commands/maintenance/drop-all.html"] will be destroyed%0A  # (because key ["/commands/maintenance/drop-all.html"] is not in for_each map)%0A  - resource "aws_s3_object" "redirects" {%0A      - bucket                 = "stage-docsstageliquibasecom-origin" -> null%0A      - bucket_key_enabled     = false -> null%0A      - content_type           = "text/html" -> null%0A      - etag                   = "5efd5c28378eb29599a8245a4097292b" -> null%0A      - force_destroy          = false -> null%0A      - id                     = "/commands/maintenance/drop-all.html" -> null%0A      - key                    = "/commands/maintenance/drop-all.html" -> null%0A      - metadata               = {%0A          - "user-agent"    = "AWSTransfer"%0A          - "user-agent-id" = "awilliams@s-53428b82285849a98"%0A        } -> null%0A      - server_side_encryption = "AES256" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {} -> null%0A      - tags_all               = {} -> null%0A      - version_id             = "null" -> null%0A    }%0A%0A  # aws_s3_object.redirects["/commands/update/drop-all.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/update/drop-all.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/maintenance/drop-all.html"%0A    }%0A%0APlan: 1 to add, 2 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @AMBERMW13, Action: `pull_request`, Working Directory: `/home/runner/work/liquibase-docs/liquibase-docs`, Workflow: `Publish Redirects to Staging for Docs`*